GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_uart.c
/*
 * Copyright (c) 2017-2018 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv6m.h"
#include "stm32l0xx.h"

#include "stm32l0_gpio.h"
#include "stm32l0_uart.h"
#include "stm32l0_dma.h"
#include "stm32l0_exti.h"
#include "stm32l0_system.h"

typedef struct _stm32l0_uart_device_t {
    stm32l0_system_notify_t notify;
    volatile uint32_t       wakeup;
    stm32l0_uart_t          *instances[UART_INSTANCE_COUNT];
} stm32l0_uart_device_t;

static stm32l0_uart_device_t stm32l0_uart_device;

#define UART_DATA_XON  0x11
#define UART_DATA_XOFF 0x13

#define UART_RX_DMA_OPTION		 \
    (DMA_OPTION_EVENT_TRANSFER_DONE |    \
     DMA_OPTION_EVENT_TRANSFER_HALF |    \
     DMA_OPTION_CIRCULAR |		 \
     DMA_OPTION_PERIPHERAL_TO_MEMORY |	 \
     DMA_OPTION_PERIPHERAL_DATA_SIZE_8 | \
     DMA_OPTION_MEMORY_DATA_SIZE_8 |	 \
     DMA_OPTION_MEMORY_DATA_INCREMENT |	 \
     DMA_OPTION_PRIORITY_MEDIUM)

#define UART_TX_DMA_OPTION		 \
    (DMA_OPTION_MEMORY_TO_PERIPHERAL |	 \
     DMA_OPTION_PERIPHERAL_DATA_SIZE_8 | \
     DMA_OPTION_MEMORY_DATA_SIZE_8 |	 \
     DMA_OPTION_MEMORY_DATA_INCREMENT |	 \
     DMA_OPTION_PRIORITY_MEDIUM)

static USART_TypeDef * const stm32l0_uart_xlate_USART[UART_INSTANCE_COUNT] = {
    USART1,
    USART2,
    USART4,
    USART5,
    LPUART1,
};

static const IRQn_Type stm32l0_uart_xlate_IRQn[UART_INSTANCE_COUNT] = {
    USART1_IRQn,
    USART2_IRQn,
    USART4_5_IRQn,
    USART4_5_IRQn,
    AES_RNG_LPUART1_IRQn,
};

static const uint32_t stm32l0_uart_xlate_IMR[UART_INSTANCE_COUNT] = {
    EXTI_IMR_IM25,
    EXTI_IMR_IM26,
    0,
    0,
    EXTI_IMR_IM28,
};

static uint32_t stm32l0_uart_dma_receive(stm32l0_uart_t *uart, uint32_t count)
{
    uint32_t events, rx_index, rx_count, rx_size, rx_write, rx_entries;
    uint8_t rx_data;

    events = 0;

    rx_index = uart->rx_index;
    uart->rx_index = count;

    if (rx_index != uart->rx_index)
    {
	rx_size = (uart->rx_size - uart->rx_count);
	rx_count = 0;
	
	rx_write = uart->rx_write;

	if (uart->option & UART_OPTION_XONOFF)
	{
	    do
	    {
		rx_data = uart->rx_fifo[rx_index];

		/* XON == 0x11, XOFF == 0x13, hence only bit 1 differs ...
		 */
		if ((rx_data | 0x02) == 0x13)
		{
		    uart->rx_xonoff = rx_data;
		}
		else
		{
		    if (rx_count == rx_size)
		    {
			events |= UART_EVENT_OVERRUN;
		    }
		    else
		    {
			uart->rx_data[rx_write] = rx_data;
			
			rx_write++;
			
			if (rx_write == uart->rx_size)
			{
			    rx_write = 0;
			}
			
			rx_count++;
		    }
		}

		rx_index++;

		if (rx_index == uart->rx_entries)
		{
		    rx_index = 0;
		}
	    }
	    while (rx_index != uart->rx_index);
	}
	else
	{
	    do
	    {
		rx_data = uart->rx_fifo[rx_index];

		if (rx_count == rx_size)
		{
		    events |= UART_EVENT_OVERRUN;
		}
		else
		{
		    uart->rx_data[rx_write] = rx_data;
		
		    rx_write++;
		
		    if (rx_write == uart->rx_size)
		    {
			rx_write = 0;
		    }
		
		    rx_count++;
		}
	    
		rx_index++;

		if (rx_index == uart->rx_entries)
		{
		    rx_index = 0;
		}
	    }
	    while (rx_index != uart->rx_index);
	}

	uart->rx_write = rx_write;

	rx_entries = armv6m_atomic_add(&uart->rx_count, rx_count);
	
	if (rx_count && !rx_entries)
	{
	    events |= UART_EVENT_RECEIVE;
	}

	if (uart->option & (UART_OPTION_RTS | UART_OPTION_XONOFF))
	{
	    if ((uart->rx_count >= uart->rx_threshold) && (rx_entries < uart->rx_threshold))
	    {
		if (uart->option & UART_OPTION_RTS)
		{
		    stm32l0_gpio_pin_write(uart->pins.rts, 1);
		    
		    /* Check for a async uart read race condition.
		     */
		    if ((uart->rx_count < uart->rx_threshold) && uart->rx_enable)
		    {
			stm32l0_gpio_pin_write(uart->pins.rts, 0);
		    }
		}

		if (uart->option & UART_OPTION_XONOFF)
		{
		    uart->tx_xonoff = UART_DATA_XOFF;
		}
	    }
	}
    }

    return events;
}

static void stm32l0_uart_stop_enter(stm32l0_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t events;

    USART->CR3 &= ~(USART_CR3_DMAR | USART_CR3_DDRE);

    events = stm32l0_uart_dma_receive(uart, stm32l0_dma_stop(uart->rx_dma));

    if (events)
    {
	(*uart->ev_callback)(uart->ev_context, events);
    }
}

static void stm32l0_uart_stop_leave(stm32l0_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    uart->rx_index = 0;

    stm32l0_dma_start(uart->rx_dma, (uint32_t)uart->rx_fifo, (uint32_t)&USART->RDR, uart->rx_entries, UART_RX_DMA_OPTION);
    
    USART->CR3 |= (USART_CR3_DMAR | USART_CR3_DDRE);
}

static void stm32l0_uart_notify_callback(void *context, uint32_t events)
{
    if (stm32l0_uart_device.wakeup)
    {
	if (events & SYSTEM_EVENT_STOP_ENTER)
	{
	    if (stm32l0_uart_device.wakeup & (1u << UART_INSTANCE_USART1))
	    {
		stm32l0_uart_stop_enter(stm32l0_uart_device.instances[UART_INSTANCE_USART1]);
	    }

