GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_uart.c
	    if (stm32l0_uart_device.wakeup & (1u << UART_INSTANCE_USART2))
	    {
		stm32l0_uart_stop_enter(stm32l0_uart_device.instances[UART_INSTANCE_USART2]);
	    }

	    if (stm32l0_uart_device.wakeup & (1u << UART_INSTANCE_LPUART1))
	    {
		stm32l0_uart_stop_enter(stm32l0_uart_device.instances[UART_INSTANCE_LPUART1]);
	    }
	}

	if (events & SYSTEM_EVENT_STOP_LEAVE)
	{
	    if (stm32l0_uart_device.wakeup & (1u << UART_INSTANCE_USART1))
	    {
		stm32l0_uart_stop_leave(stm32l0_uart_device.instances[UART_INSTANCE_USART1]);
	    }

	    if (stm32l0_uart_device.wakeup & (1u << UART_INSTANCE_USART2))
	    {
		stm32l0_uart_stop_leave(stm32l0_uart_device.instances[UART_INSTANCE_USART2]);
	    }

	    if (stm32l0_uart_device.wakeup & (1u << UART_INSTANCE_LPUART1))
	    {
		stm32l0_uart_stop_leave(stm32l0_uart_device.instances[UART_INSTANCE_LPUART1]);
	    }
	}
    }
}

static void stm32l0_uart_dma_callback(stm32l0_uart_t *uart)
{
    uint32_t events;

    events = stm32l0_uart_dma_receive(uart, stm32l0_dma_count(uart->rx_dma));

    if (events)
    {
	(*uart->ev_callback)(uart->ev_context, events);
    }
}

static void stm32l0_uart_start(stm32l0_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    if ((uart->instance == UART_INSTANCE_USART1) || (uart->instance == UART_INSTANCE_USART2))
    {
	stm32l0_system_hsi16_enable();
    }
    
    if ((uart->instance == UART_INSTANCE_LPUART1) && ((RCC->CCIPR & (RCC_CCIPR_LPUART1SEL_1 | RCC_CCIPR_LPUART1SEL_0)) == RCC_CCIPR_LPUART1SEL_1))
    {
	stm32l0_system_hsi16_enable();
    }

    if (uart->rx_dma != DMA_CHANNEL_NONE)
    {
	stm32l0_dma_enable(uart->rx_dma, (stm32l0_dma_callback_t)stm32l0_uart_dma_callback, uart);
    }
    
    if (uart->tx_dma != DMA_CHANNEL_NONE)
    {
	stm32l0_dma_enable(uart->tx_dma, NULL, NULL);
    }

    if (uart->option & UART_OPTION_WAKEUP)
    {
	if (uart->baudrate > 9600)
	{
	    stm32l0_system_lock(SYSTEM_LOCK_REGULATOR);
	}
	
	armv6m_atomic_or(&EXTI->IMR, stm32l0_uart_xlate_IMR[uart->instance]);

	stm32l0_gpio_pin_configure(uart->pins.rx, (GPIO_PARK_NONE | GPIO_PUPD_PULLDOWN | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));

	if (uart->option & UART_OPTION_RTS)
	{
	    stm32l0_gpio_pin_configure(uart->pins.rts, (GPIO_PARK_NONE | GPIO_PUPD_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_OUTPUT));
	    stm32l0_gpio_pin_write(uart->pins.rts, 0);
	}
    }
    else
    {
	stm32l0_gpio_pin_configure(uart->pins.rx, (GPIO_PARK_HIZ | GPIO_PUPD_PULLDOWN | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));

	if (uart->option & UART_OPTION_RTS)
	{
	    stm32l0_gpio_pin_configure(uart->pins.rts, (GPIO_PARK_HIZ | GPIO_PUPD_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_OUTPUT));
	    stm32l0_gpio_pin_write(uart->pins.rts, 0);
	}
    }

    USART->CR1 |= USART_CR1_UE;

    USART->ICR = (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NCF | USART_ICR_ORECF | USART_ICR_IDLECF | USART_ICR_WUCF | USART_ICR_TCCF);

    USART->CR1 |= USART_CR1_RE;
    
    /* Wait for receiver to be enabled and flush partial corrupt input.
     */
    while (!(USART->ISR & USART_ISR_REACK))
    {
    }

    USART->RQR = USART_RQR_RXFRQ;

    /* The receiver always starts within outside STOP lockout zone, so that
     * there will be a spurious IDLE event. Otherwise a disconnected RX
     * line will be a STOP lockout.
     */

    /* Start DMA after the receiver is alive and flushed.
     */
    if (uart->rx_dma == stm32l0_dma_channel(uart->rx_dma))
    {
	uart->rx_index = 0;

	stm32l0_dma_start(uart->rx_dma, (uint32_t)uart->rx_fifo, (uint32_t)&USART->RDR, uart->rx_entries, UART_RX_DMA_OPTION);
	
	USART->CR3 |= (USART_CR3_DMAR | USART_CR3_DDRE);

	if (uart->option & UART_OPTION_WAKEUP)
	{
	    armv6m_atomic_or(&stm32l0_uart_device.wakeup, (1u << uart->instance));
	}
    }

    if ((uart->state != UART_STATE_BREAK) && (uart->state != UART_STATE_SUSPENDED_BREAK))
    {
	if (uart->option & UART_OPTION_WAKEUP)
	{
	  // stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_NONE | GPIO_PUPD_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	  stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_NONE | GPIO_PUPD_PULLUP | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	}
	else
	{
	  // stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_HIZ | GPIO_PUPD_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	  stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_HIZ | GPIO_PUPD_PULLUP | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	}
	
	if (uart->option & UART_OPTION_CTS)
	{
	    stm32l0_gpio_pin_configure(uart->pins.cts, (GPIO_PARK_HIZ | GPIO_PUPD_PULLDOWN | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	    
	    USART->CR3 |= USART_CR3_CTSE;
	}

	USART->CR1 |= USART_CR1_TE;
	    
	while (!(USART->ISR & USART_ISR_TEACK))
	{
	}
    }

    USART->CR3 |= USART_CR3_EIE;
    USART->CR1 |= (USART_CR1_PEIE | USART_CR1_IDLEIE | USART_CR1_RXNEIE);
}

static void stm32l0_uart_stop(stm32l0_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t events;

    USART->CR1 &= ~(USART_CR1_PEIE | USART_CR1_IDLEIE | USART_CR1_RXNEIE);
    USART->CR3 &= ~USART_CR3_EIE;
    
    if ((uart->state != UART_STATE_BREAK) && (uart->state != UART_STATE_SUSPENDED_BREAK))
    {
	USART->CR1 &= ~USART_CR1_TE;
	    
	while (!(USART->ISR & USART_ISR_TEACK))
	{
	}
	
	stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_HIZ | GPIO_MODE_ANALOG));
	
	if (uart->option & UART_OPTION_CTS)
	{
	    USART->CR3 &= ~USART_CR3_CTSE;
	    
	    stm32l0_gpio_pin_configure(uart->pins.cts, (GPIO_PARK_HIZ | GPIO_MODE_ANALOG));
	}
    }

    if (USART->CR3 & USART_CR3_DMAR)
    {
	USART->CR3 &= ~(USART_CR3_DMAR | USART_CR3_DDRE);

	events = stm32l0_uart_dma_receive(uart, stm32l0_dma_stop(uart->rx_dma));
	
	if (events)
	{
	    (*uart->ev_callback)(uart->ev_context, events);
	}
    }

    USART->CR1 &= ~USART_CR1_RE;

    while (!(USART->ISR & USART_ISR_REACK))
    {
    }
    
    stm32l0_gpio_pin_configure(uart->pins.rx, (GPIO_PARK_HIZ | GPIO_MODE_ANALOG));

    if (uart->option & UART_OPTION_RTS)
    {
	stm32l0_gpio_pin_configure(uart->pins.rts, (GPIO_PARK_HIZ | GPIO_MODE_ANALOG));
    }
	
