GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_uart.c
    USART->CR1 &= ~USART_CR1_UE;
	
    if (uart->option & UART_OPTION_WAKEUP)
    {
	if (uart->baudrate > 9600)
	{
	    stm32l0_system_unlock(SYSTEM_LOCK_REGULATOR);
	}
	
	armv6m_atomic_and(&EXTI->IMR, ~stm32l0_uart_xlate_IMR[uart->instance]);
	
	armv6m_atomic_and(&stm32l0_uart_device.wakeup, ~(1u << uart->instance));
    }
	
    if (uart->rx_dma == stm32l0_dma_channel(uart->rx_dma))
    {
	stm32l0_dma_disable(uart->rx_dma);
    }
    
    if (uart->tx_dma == stm32l0_dma_channel(uart->tx_dma))
    {
	stm32l0_dma_disable(uart->tx_dma);
    }

    if ((uart->instance == UART_INSTANCE_USART1) || (uart->instance == UART_INSTANCE_USART2))
    {
	stm32l0_system_hsi16_disable();
    }
    
    if ((uart->instance == UART_INSTANCE_LPUART1) && ((RCC->CCIPR & (RCC_CCIPR_LPUART1SEL_1 | RCC_CCIPR_LPUART1SEL_0)) == RCC_CCIPR_LPUART1SEL_1))
    {
	stm32l0_system_hsi16_disable();
    }

    if (uart->rx_sequence)
    {
	stm32l0_system_unlock(SYSTEM_LOCK_STOP);
	
	uart->rx_sequence = 0;
    }
}

static void stm32l0_uart_exti_callback(stm32l0_uart_t *uart)
{
    stm32l0_exti_detach(uart->pins.rx);
    
    stm32l0_system_periph_enable(SYSTEM_PERIPH_USART1 + uart->instance);

    stm32l0_uart_start(uart);
    
    NVIC_EnableIRQ(uart->interrupt);
    
    uart->state = (uart->state == UART_STATE_SUSPENDED_BREAK) ? UART_STATE_BREAK : UART_STATE_READY;

    if (!uart->rx_sequence)
    {
	uart->rx_sequence = 1;
	
	stm32l0_system_lock(SYSTEM_LOCK_STOP);
    }
    
    (*uart->ev_callback)(uart->ev_context, UART_EVENT_WAKEUP);
}

static void stm32l0_uart_interrupt(stm32l0_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t events, rx_write, rx_entries, tx_count;
    uint8_t rx_data;

    events = 0;

    USART->ICR = USART_ICR_WUCF;

    if (!(USART->CR3 & USART_CR3_DMAR))
    {
	if (USART->ISR & USART_ISR_RXNE)
	{
	    rx_data = USART->RDR;
		
	    if (USART->ISR & (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE))
	    {
		if (USART->ISR & USART_ISR_NE)
		{
		    events |= UART_EVENT_NOISE;
		}
		else
		{
		    if (USART->ISR & USART_ISR_FE)
		    {
			if (rx_data == 0x00)
			{
			    events |= UART_EVENT_BREAK;
			}
			else
			{
			    events |= UART_EVENT_FRAMING;
			}
		    }
		    else
		    {
			events |= UART_EVENT_PARITY;
		    }
		}
		
		USART->ICR = (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NCF);
	    }
	    else
	    {
		/* XON == 0x11, XOFF == 0x13, hence only bit 1 differs ...
		 */
		if ((uart->option & UART_OPTION_XONOFF) && ((rx_data | 0x02) == 0x13))
		{
		    uart->rx_xonoff = rx_data;
		}
		else
		{
		    if (uart->rx_count == uart->rx_size)
		    {
			events |= UART_EVENT_OVERRUN;
		    }
		    else
		    {
			rx_write = uart->rx_write;
			    
			uart->rx_data[rx_write] = rx_data;
			
			rx_write++;
			
			if (rx_write == uart->rx_size)
			{
			    rx_write = 0;
			}
		    
			uart->rx_write = rx_write;
			
			rx_entries = armv6m_atomic_add(&uart->rx_count, 1);
			
			if (!rx_entries)
			{
			    events |= UART_EVENT_RECEIVE;
			}
			
			if (uart->option & (UART_OPTION_RTS | UART_OPTION_XONOFF))
			{
			    if (uart->rx_count == uart->rx_threshold)
			    {
				if (uart->option & UART_OPTION_RTS)
				{
				    stm32l0_gpio_pin_write(uart->pins.rts, 1);
				    
				    /* Check for a async uart read race condition.
				     */
				    if ((uart->rx_count < uart->rx_threshold) && uart->rx_enable)
				    {
					stm32l0_gpio_pin_write(uart->pins.rts, 0);
				    }
				}

				if (uart->option & UART_OPTION_XONOFF)
				{
				    uart->tx_xonoff = UART_DATA_XOFF;
				}
			    }
			}
		    }
		}

		if (!uart->rx_sequence)
		{
		    uart->rx_sequence = 1;

		    stm32l0_system_lock(SYSTEM_LOCK_STOP);
		}
	    }
	}
	
	if (USART->ISR & USART_ISR_ORE)
	{
	    events |= UART_EVENT_OVERRUN;
		
	    USART->ICR = USART_ICR_ORECF;
	}
    }
    else
    {
	if (USART->ISR & (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE))
	{
	    events |= stm32l0_uart_dma_receive(uart, stm32l0_dma_count(uart->rx_dma));

	    rx_data = USART->RDR;
		
	    if (USART->ISR & USART_ISR_NE)
	    {
		events |= UART_EVENT_NOISE;
	    }
	    else
	    {
		if (USART->ISR & USART_ISR_FE)
		{
		    if (rx_data == 0x00)
		    {
			events |= UART_EVENT_BREAK;
		    }
		    else
		    {
			events |= UART_EVENT_FRAMING;
		    }
		}
		else
		{
		    events |= UART_EVENT_PARITY;
		}
	    }
	    
	    USART->ICR = (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NCF);
	    
	    if (USART->ISR & USART_ISR_ORE)
	    {
		events |= UART_EVENT_OVERRUN;
		
		USART->ICR = USART_ICR_ORECF;
	    }
	}
	else
	{
	    /* Setting the RXNE flags triggers a DMA, which means
	     * by the time we get here the flasg is cleared again ...
	     */

	    if (!uart->rx_sequence && (uart->rx_index != stm32l0_dma_count(uart->rx_dma)))
	    {
		uart->rx_sequence = 1;
		
		stm32l0_system_lock(SYSTEM_LOCK_STOP);
		
		USART->CR1 &= ~USART_CR1_RXNEIE;
	    }
	}
    }

    if (USART->ISR & USART_ISR_IDLE)
    {
	if (USART->CR3 & USART_CR3_DMAR)
	{
	    events |= stm32l0_uart_dma_receive(uart, stm32l0_dma_count(uart->rx_dma));
	}

	if (uart->rx_sequence)
	{
	    USART->CR1 |= USART_CR1_RXNEIE;
	    
	    stm32l0_system_unlock(SYSTEM_LOCK_STOP);
	    
	    uart->rx_sequence = 0;
	}

	USART->ICR = USART_ICR_IDLECF;
    }

    if (events)
    {
	(*uart->ev_callback)(uart->ev_context, events);
    }

    if (uart->rq_suspend)
    {
	NVIC_DisableIRQ(uart->interrupt);

	stm32l0_uart_stop(uart);

	stm32l0_system_periph_disable(SYSTEM_PERIPH_USART1 + uart->instance);

	uart->state = (uart->state == UART_STATE_BREAK) ? UART_STATE_SUSPENDED_BREAK : UART_STATE_SUSPENDED;
	
	uart->rq_suspend = 0;
	uart->rq_break = 0;

	stm32l0_gpio_pin_configure(uart->pins.rx, (GPIO_PARK_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_INPUT));

	stm32l0_exti_attach(uart->pins.rx, EXTI_CONTROL_EDGE_FALLING | EXTI_CONTROL_EDGE_RISING, (stm32l0_exti_callback_t)stm32l0_uart_exti_callback, uart);
    }

    if (uart->rq_break)
    {
	USART->CR1 &= ~USART_CR1_TE;
	
	while (!(USART->ISR & USART_ISR_TEACK))
	{
	}
	
	stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_HIZ | GPIO_MODE_ANALOG));
	
	if (uart->option & UART_OPTION_CTS)
	{
	    USART->CR3 &= ~USART_CR3_CTSE;
	    
	    stm32l0_gpio_pin_configure(uart->pins.cts, (GPIO_PARK_HIZ | GPIO_MODE_ANALOG));
	}
	
