GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_uart.c
	uart->state = UART_STATE_BREAK;

	uart->rq_break = 0;
    }

    if (uart->rq_inject)
    {
	if ((uart->rx_count < uart->rx_threshold) && uart->rx_enable)
	{
	    uart->tx_xonoff = UART_DATA_XON;
	}
	else
	{
	    uart->tx_xonoff = UART_DATA_XOFF;
	}

	uart->rq_inject = 0;
    }

    if (uart->state == UART_STATE_TRANSMIT)
    {
	if (USART->ISR & USART_ISR_TC)
	{
	    USART->ICR = USART_ICR_TCCF;
	    
	    USART->CR1 &= ~USART_CR1_TCIE;
	    
	    if (USART->CR3 & USART_CR3_DMAT)
	    {
		USART->CR3 &= ~USART_CR3_DMAT;
		
		tx_count = stm32l0_dma_stop(uart->tx_dma);
		
		uart->tx_data += tx_count;
		uart->tx_count -= tx_count;
	    }

	    uart->tx_data = NULL;
		
	    uart->state = UART_STATE_READY; 
		    
	    stm32l0_system_unlock(SYSTEM_LOCK_STOP);

	    if (uart->tx_callback)
	    {
		(*uart->tx_callback)(uart->tx_context);
	    }
	}

	if (uart->tx_xonoff)
	{
	    if (uart->state == UART_STATE_TRANSMIT)
	    {
		if (USART->CR3 & USART_CR3_DMAT)
		{
		    USART->CR3 &= ~USART_CR3_DMAT;
		    
		    tx_count = stm32l0_dma_stop(uart->tx_dma);
		    
		    uart->tx_data += tx_count;
		    uart->tx_count -= tx_count;
		}
		
		USART->CR1 &= ~USART_CR1_TXEIE;
		USART->CR1 |= USART_CR1_TCIE;

		uart->state = UART_STATE_INJECT; 
	    }
	    else
	    {
		USART->CR1 |= USART_CR1_TCIE;
		
		USART->TDR = uart->tx_xonoff;
		
		uart->tx_xonoff = 0x00;
		
		uart->state = UART_STATE_WAIT;

		stm32l0_system_lock(SYSTEM_LOCK_STOP);
	    }
	}
	else
	{
	    if (uart->tx_data && (uart->rx_xonoff == UART_DATA_XOFF))
	    {
		if (USART->CR3 & USART_CR3_DMAT)
		{
		    USART->CR3 &= ~USART_CR3_DMAT;
		    
		    tx_count = stm32l0_dma_stop(uart->tx_dma);
		    
		    uart->tx_data += tx_count;
		    uart->tx_count -= tx_count;
		}
		
		USART->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);
		
		uart->state = UART_STATE_READY; 
		
		stm32l0_system_unlock(SYSTEM_LOCK_STOP);
	    }
	    else
	    {
		if (USART->CR1 & USART_CR1_TXEIE)
		{
		    if (USART->ISR & USART_ISR_TXE)
		    {
			uart->tx_count--;
			
			if (uart->tx_count == 0)
			{
			    USART->CR1 = (USART->CR1 & ~USART_CR1_TXEIE) | USART_CR1_TCIE;
			}
			
			USART->TDR = *uart->tx_data++;
		    }
		}
	    }
	}
    }

    if (uart->state == UART_STATE_INJECT)
    {
	if (USART->ISR & USART_ISR_TC)
	{
	    USART->ICR = USART_ICR_TCCF;

	    USART->TDR = uart->tx_xonoff;

	    uart->tx_xonoff = 0x00;

	    uart->state = UART_STATE_WAIT;
	}
    }

    if (uart->state == UART_STATE_WAIT)
    {
	if (USART->ISR & USART_ISR_TC)
	{
	    USART->ICR = USART_ICR_TCCF;

	    if (uart->tx_xonoff)
	    {
		USART->TDR = uart->tx_xonoff;
		
		uart->tx_xonoff = 0x00;
		
		uart->state = UART_STATE_WAIT;
	    }
	    else
	    {
		USART->CR1 &= ~USART_CR1_TCIE;

		uart->state = UART_STATE_READY;

		stm32l0_system_unlock(SYSTEM_LOCK_STOP);
	    }
	}
    }

    if (uart->state == UART_STATE_READY)
    {
	if (uart->tx_xonoff)
	{
	    USART->CR1 |= USART_CR1_TCIE;
		
	    USART->TDR = uart->tx_xonoff;
		
	    uart->tx_xonoff = 0x00;
	    
	    uart->state = UART_STATE_WAIT;

	    stm32l0_system_lock(SYSTEM_LOCK_STOP);
	}
	else
	{
	    if (uart->tx_data && (uart->rx_xonoff == UART_DATA_XON))
	    {
		stm32l0_system_lock(SYSTEM_LOCK_STOP);
		
		if (uart->tx_dma == stm32l0_dma_channel(uart->tx_dma))
		{
		    USART->CR3 |= USART_CR3_DMAT;
		    
		    USART->CR1 |= USART_CR1_TCIE;
		    
		    stm32l0_dma_start(uart->tx_dma, (uint32_t)&USART->TDR, (uint32_t)uart->tx_data, uart->tx_count, UART_TX_DMA_OPTION);
		}
		else
		{
		    uart->tx_count--;
		    
		    if (uart->tx_count == 0)
		    {
			USART->CR1 |= USART_CR1_TCIE;
		    }
		    else
		    {
			USART->CR1 |= USART_CR1_TXEIE;
		    }
		    
		    USART->TDR = *uart->tx_data++;
		}
		
		uart->state = UART_STATE_TRANSMIT;
	    }
	}
    }
}

bool stm32l0_uart_create(stm32l0_uart_t *uart, const stm32l0_uart_params_t *params)
{
    if (params->instance >= UART_INSTANCE_COUNT)
    {
	return false;
    }

    uart->USART = stm32l0_uart_xlate_USART[params->instance];
    uart->instance = params->instance;
    uart->interrupt = stm32l0_uart_xlate_IRQn[params->instance];
    uart->priority = params->priority;
    uart->rx_dma = params->rx_dma;
    uart->tx_dma = params->tx_dma;
    uart->pins = params->pins;

    uart->rx_fifo = params->rx_fifo;
    uart->rx_entries = params->rx_entries;

    stm32l0_uart_device.instances[uart->instance] = uart;

    uart->state = UART_STATE_INIT;

    if (!stm32l0_uart_device.notify.callback)
    {
	stm32l0_system_notify(&stm32l0_uart_device.notify, stm32l0_uart_notify_callback, NULL, (SYSTEM_EVENT_STOP_ENTER | SYSTEM_EVENT_STOP_LEAVE));
    }

    return true;
}

bool stm32l0_uart_destroy(stm32l0_uart_t *uart)
{
    if (uart->state != UART_STATE_INIT)
    {
	return false;
    }

    uart->state = UART_STATE_NONE;

    stm32l0_uart_device.instances[uart->instance] = NULL;

    return true;
}


bool stm32l0_uart_enable(stm32l0_uart_t *uart, uint8_t *rx_data, uint32_t rx_size, uint32_t baudrate, uint32_t option, stm32l0_uart_event_callback_t callback, void *context)
{
    if (uart->state != UART_STATE_INIT)
    {
	return false;
    }
    
    if ((rx_data == NULL) || (rx_size < 16))
    {
	return false;
    }

    uart->rx_index = 0;
    uart->rx_threshold = rx_size - (((uart->rx_entries + 1) / 2) + 4); // 4 extra characters plus half the FIFO
    uart->rx_data = rx_data;
    uart->rx_size = rx_size;
    uart->rx_read = 0;
    uart->rx_write = 0;
    uart->rx_count = 0;
    uart->rx_sequence = 0;
    uart->rx_enable = 1;
    uart->rx_xonoff = UART_DATA_XON;

    uart->tx_callback = NULL;
    uart->tx_context = NULL;
    uart->tx_data = NULL;
    uart->tx_count = 0;
    uart->tx_xonoff = 0;
    uart->rq_suspend = 0;
    uart->rq_break = 0;
    uart->rq_inject = 0;

    uart->ev_callback = callback;
    uart->ev_context = context;

    uart->state = UART_STATE_BUSY;

    if (!stm32l0_uart_configure(uart, baudrate, option))
    {
	uart->state = UART_STATE_INIT;

	return false;
    }

    NVIC_SetPriority(uart->interrupt, uart->priority);
    NVIC_EnableIRQ(uart->interrupt);

    uart->state = UART_STATE_READY;

