GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_uart.c
    return true;
}

bool stm32l0_uart_disable(stm32l0_uart_t *uart)
{
    if ((uart->state != UART_STATE_READY) && (uart->state != UART_STATE_BREAK))
    {
	return false;
    }

    NVIC_DisableIRQ(uart->interrupt);

    stm32l0_uart_stop(uart);

    stm32l0_system_periph_disable(SYSTEM_PERIPH_USART1 + uart->instance);

    uart->state = UART_STATE_INIT;

    return true;
}

bool stm32l0_uart_configure(stm32l0_uart_t *uart, uint32_t baudrate, uint32_t option)
{
    USART_TypeDef *USART = uart->USART;
    uint32_t usart_cr1, usart_cr2, usart_cr3, usart_brr;

    if ((uart->state != UART_STATE_READY) && (uart->state != UART_STATE_BUSY))
    {
	return false;
    }

    if ((baudrate == 0) || (baudrate > 1000000))
    {
	return false;
    }

    if (option & UART_OPTION_WAKEUP)
    {
	if ((uart->instance == UART_INSTANCE_USART4) || (uart->instance == UART_INSTANCE_USART5))
	{
	    return false;
	}
    }

    if (uart->state == UART_STATE_BUSY)
    {
	stm32l0_system_periph_enable(SYSTEM_PERIPH_USART1 + uart->instance);
    }
    else
    {
	stm32l0_uart_stop(uart);
    }

    usart_cr1 = 0;
    usart_cr2 = 0;
    usart_cr3 = 0;

    if (option & UART_OPTION_STOP_2)
    {
	usart_cr2 |= USART_CR2_STOP_1;
    }

    if (option & (UART_OPTION_PARITY_EVEN | UART_OPTION_PARITY_ODD))
    {
	usart_cr1 |= USART_CR1_PCE;
	
	if (option & UART_OPTION_PARITY_ODD)
	{
	    usart_cr1 |= USART_CR1_PS;
	}
	
	usart_cr1 |= ((option & UART_OPTION_DATA_SIZE_8) ? USART_CR1_M0 : 0);
    }
    else
    {
	usart_cr1 |= ((option & UART_OPTION_DATA_SIZE_8) ? 0 : USART_CR1_M1);
    }

    if (option & UART_OPTION_WAKEUP)
    {
	/* This really, really requires an explanation, how deal with WAKEUP
	 * and STOP.
	 *
	 * The very first received byte sets uart->rx_sequence and locks out STOP
	 * mode. That is handled for ISR based receive as well as DMA based receive.
	 * In the latter case the RXNEIE flag will be cleared after the first byte.
	 * Later on when the IDLE condition is detected the uart->rx_sequence flag
	 * is cleared again, and RXNEIE is set. Hence between the first byte and the 
	 * subsequent IDLE condition, the system cannot enter STOP mode. Consequently
	 * when entering STOP mode RXNEIE is always set, the USART/LPUART can use
	 * RXNE as wakeup flag. 
	 *
	 * Next, if STOP mode is entered when DMA is active, DMA gets disabled
	 * BEFORE entering STOP mode, and DMA gets enabled right AFTER leaving
	 * STOP mode. Hence the byte in USART->RDR will be sent directly to
	 * DMA and the uart->rx_sequence logic in stm32l0_uart_interrupt()
	 * will block STOP mode, till the next IDLE condition.
	 *
	 * USART/LPUART can wakeup from STOP with the LowPower Voltage Regulator
	 * up to 9600 baud. Above that the Main Voltage Regulator has to be used.
	 * Hence SYSTEM_LOCK_REGULATOR.
	 *
	 * Above 38400 baud HSI16 cannot wakeup fast enough to guarantee a proper
	 * sampled signal. That means that HSI16 has to be kept alive during STOP
	 * mode, which is done via USART_CR3_UCESM.
	 *
	 * For USART1/USART2 to increase the tolerance of the sampled signal,
	 * USART_CR3_ONEBIT is used for the data bits.
	 */

	usart_cr1 |= USART_CR1_UESM;
	usart_cr3 |= (USART_CR3_WUS_1 | USART_CR3_WUS_0 | USART_CR3_ONEBIT);

	if (baudrate > 38400)
	{
	    usart_cr3 |= USART_CR3_UCESM;
	}
    }

    if (option & UART_OPTION_RX_INVERT)
    {
	usart_cr2 |= USART_CR2_RXINV;
    }

    if (option & UART_OPTION_TX_INVERT)
    {
	usart_cr2 |= USART_CR2_TXINV;
    }

    if ((uart->instance == UART_INSTANCE_USART2) || (uart->instance == UART_INSTANCE_USART2))
    {
	usart_brr = ((16000000u + (baudrate >> 1)) / baudrate);              /* HSI16 */

	armv6m_atomic_modify(&RCC->CCIPR, ((RCC_CCIPR_USART1SEL_1 | RCC_CCIPR_USART1SEL_0) << (uart->instance * 2)), ((RCC_CCIPR_USART1SEL_1) << (uart->instance * 2)));
    }
    else if (uart->instance == UART_INSTANCE_LPUART1)
    {
	if (baudrate <= 9600)
	{
	    usart_brr = (256u * 32768u + (baudrate >> 1)) / baudrate;        /* LSE */

	    armv6m_atomic_modify(&RCC->CCIPR, (RCC_CCIPR_LPUART1SEL_1 | RCC_CCIPR_LPUART1SEL_0), (RCC_CCIPR_LPUART1SEL_1 | RCC_CCIPR_LPUART1SEL_0));
	}
	else
	{
	    usart_brr = (256u * 16000000u + (baudrate >> 1)) / baudrate;     /* HSI16 */

	    armv6m_atomic_modify(&RCC->CCIPR, (RCC_CCIPR_LPUART1SEL_1 | RCC_CCIPR_LPUART1SEL_0), (RCC_CCIPR_LPUART1SEL_1));
	}
    }
    else
    {
	usart_brr = (stm32l0_system_pclk1() + (baudrate >> 1)) / baudrate;   /* PCLK1 */
    }

    uart->baudrate = baudrate;
    uart->option = option;

    USART->BRR = usart_brr;
    USART->CR3 = usart_cr3;
    USART->CR2 = usart_cr2;
    USART->CR1 = usart_cr1;

    stm32l0_uart_start(uart);

    return true;
}

bool stm32l0_uart_suspend(stm32l0_uart_t *uart)
{
    if (uart->state < UART_STATE_READY)
    {
	return false;
    }

    if (uart->rq_suspend || uart->rq_break || uart->tx_data || (uart->state >= UART_STATE_BREAK))
    {
	return false;
    }
    
    uart->rq_suspend = 1;

    NVIC_SetPendingIRQ(uart->interrupt);

    return true;
}

bool stm32l0_uart_resume(stm32l0_uart_t *uart)
{
    return true;

    if (uart->state < UART_STATE_READY)
    {
	return false;
    }

    uart->rq_suspend = 0;

    stm32l0_exti_detach(uart->pins.rx);
    
    if ((uart->state == UART_STATE_SUSPENDED) || (uart->state == UART_STATE_SUSPENDED_BREAK))
    {
	stm32l0_system_periph_enable(SYSTEM_PERIPH_USART1 + uart->instance);

	stm32l0_uart_start(uart);

	NVIC_EnableIRQ(uart->interrupt);

	uart->state = (uart->state == UART_STATE_SUSPENDED_BREAK) ? UART_STATE_BREAK : UART_STATE_READY;
    }

    return true;
}

bool stm32l0_uart_rts_enable(stm32l0_uart_t *uart, bool onoff)
{
    if (uart->state < UART_STATE_READY)
    {
	return false;
    }

    uart->rx_enable = onoff;

    if (uart->option & UART_OPTION_RTS)
    {
	if (!uart->rx_enable)
	{
	    stm32l0_gpio_pin_write(uart->pins.rts, 1);
	}
	else
	{
	    if (uart->rx_count < uart->rx_threshold)
	    {
		stm32l0_gpio_pin_write(uart->pins.rts, 0);
	    
		/* Check for a async uart interrupt race condition.
		 */
		if (uart->rx_count >= uart->rx_threshold)
		{
		    stm32l0_gpio_pin_write(uart->pins.rts, 1);
		}
	    }
	}
    }

