GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_uart.c
    if (uart->option & UART_OPTION_XONOFF)
    {
	uart->rq_inject = 1;

	NVIC_SetPendingIRQ(uart->interrupt);
    }

    return true;
}

bool stm32l0_uart_cts_holding(stm32l0_uart_t *uart)
{
    USART_TypeDef *USART = uart->USART;

    if (uart->state < UART_STATE_READY)
    {
	return false;
    }

    if (!(uart->option & UART_OPTION_CTS))
    {
	return true;
    }

    return !!(USART->ISR & USART_ISR_CTS);
}

bool stm32l0_uart_break_state(stm32l0_uart_t *uart, bool onoff)
{
    USART_TypeDef *USART = uart->USART;

    if (uart->state < UART_STATE_READY)
    {
	return false;
    }

    if (onoff)
    {
	if (uart->rq_suspend || uart->rq_break || uart->tx_data || (uart->state >= UART_STATE_BREAK))
	{
	    return false;
	}

	uart->rq_break = 1;

	NVIC_SetPendingIRQ(uart->interrupt);
    }
    else
    {
	uart->rq_break = 0;

	if (uart->state == UART_STATE_BREAK)
	{
	    if (uart->option & UART_OPTION_WAKEUP)
	    {
		// stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_NONE | GPIO_PUPD_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
		stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_NONE | GPIO_PUPD_PULLUP | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	    }
	    else
	    {
		// stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_HIZ | GPIO_PUPD_NONE | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
		stm32l0_gpio_pin_configure(uart->pins.tx, (GPIO_PARK_HIZ | GPIO_PUPD_PULLUP | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	    }

	    if (uart->option & UART_OPTION_CTS)
	    {
		stm32l0_gpio_pin_configure(uart->pins.cts, (GPIO_PARK_HIZ | GPIO_PUPD_PULLDOWN | GPIO_OSPEED_VERY_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));

		armv6m_atomic_or(&USART->CR3, USART_CR3_CTSE);
	    }

	    armv6m_atomic_or(&USART->CR1, USART_CR1_TE);
	    
	    while (!(USART->ISR & USART_ISR_TEACK))
	    {
	    }
	}
    }

    return true;
}

uint32_t stm32l0_uart_count(stm32l0_uart_t *uart)
{
    if (uart->state < UART_STATE_READY)
    {
	return 0;
    }

    return uart->rx_count;
}

uint32_t stm32l0_uart_receive(stm32l0_uart_t *uart, uint8_t *rx_data, uint32_t rx_count, bool peek)
{
    uint32_t rx_size, rx_entries, rx_read;

    if (uart->state < UART_STATE_READY)
    {
	return 0;
    }

    if (rx_count > uart->rx_count)
    {
	rx_count = uart->rx_count;
    }

    rx_read = uart->rx_read;
    rx_size = rx_count;

    if ((rx_read + rx_size) > uart->rx_size)
    {
	rx_size = uart->rx_size - rx_read;
    }

    memcpy(rx_data, &uart->rx_data[rx_read], rx_size);

    rx_data += rx_size;
    rx_read += rx_size;

    if (rx_read == uart->rx_size)
    {
	rx_read = 0;
    }

    if (rx_count != rx_size)
    {
	rx_size = rx_count - rx_size;

	memcpy(rx_data, &uart->rx_data[rx_read], rx_size);

	rx_data += rx_size;
	rx_read += rx_size;
    }

    if (!peek)
    {
	uart->rx_read = rx_read;

	rx_entries = armv6m_atomic_sub(&uart->rx_count, rx_count);

	if (uart->option & (UART_OPTION_RTS | UART_OPTION_XONOFF))
	{
	    if ((rx_entries >= uart->rx_threshold) && (uart->rx_count < uart->rx_threshold))
	    {
		if ((uart->option & UART_OPTION_RTS) && uart->rx_enable)
		{
		    stm32l0_gpio_pin_write(uart->pins.rts, 0);
		
		    /* Check for a async uart interrupt race condition.
		     */
		    if (uart->rx_count >= uart->rx_threshold)
		    {
			stm32l0_gpio_pin_write(uart->pins.rts, 1);
		    }
		}

		if (uart->option & UART_OPTION_XONOFF)
		{
		    uart->rq_inject = 1;

		    NVIC_SetPendingIRQ(uart->interrupt);
		}
	    }
	}
    }

    return rx_count;
}


bool stm32l0_uart_transmit(stm32l0_uart_t *uart, const uint8_t *tx_data, uint32_t tx_count, stm32l0_uart_done_callback_t callback, void *context)
{
    if (uart->state < UART_STATE_READY)
    {
	return false;
    }

    if (uart->rq_suspend || uart->rq_break || uart->tx_data || (uart->state >= UART_STATE_BREAK))
    {
	return false;
    }

    uart->tx_callback = callback;
    uart->tx_context = context;
    uart->tx_count = tx_count;
    uart->tx_data = tx_data;

    NVIC_SetPendingIRQ(uart->interrupt);

    return true;
}

bool stm32l0_uart_done(stm32l0_uart_t *uart)
{
    return ((uart->state == UART_STATE_READY) && !uart->tx_data);
}

void USART1_IRQHandler(void)
{
    stm32l0_uart_interrupt(stm32l0_uart_device.instances[UART_INSTANCE_USART1]);
}

void USART2_IRQHandler(void)
{
    stm32l0_uart_interrupt(stm32l0_uart_device.instances[UART_INSTANCE_USART2]);
}

void USART4_5_IRQHandler(void)
{
    if (stm32l0_uart_device.instances[UART_INSTANCE_USART4])
    {
	stm32l0_uart_interrupt(stm32l0_uart_device.instances[UART_INSTANCE_USART4]);
    }

    if (stm32l0_uart_device.instances[UART_INSTANCE_USART5])
    {
	stm32l0_uart_interrupt(stm32l0_uart_device.instances[UART_INSTANCE_USART5]);
    }
}

void AES_RNG_LPUART1_IRQHandler(void)
{
    stm32l0_uart_interrupt(stm32l0_uart_device.instances[UART_INSTANCE_LPUART1]);
}
